export const LOCATION_DATA: Record<string, string[]> = {
  黄浦区: ['人民广场', '外滩', '老西门'],
  徐汇区: ['徐家汇', '漕河泾', '田林', '康健'],
  长宁区: ['中山公园', '古北', '天山'],
  静安区: ['南京西路', '曹家渡', '大宁'],
  普陀区: ['长寿路', '武宁', '长风'],
  虹口区: ['四川北路', '北外滩', '凉城'],
  杨浦区: ['五角场', '新江湾城', '控江路'],
  闵行区: ['古美罗阳', '梅陇', '莘庄', '七宝', '颛桥', '浦江'],
  浦东新区: ['陆家嘴', '世纪公园', '塘桥', '三林', '张江', '金桥'],
  宝山区: ['大华', '共康', '淞南', '顾村'],
  嘉定区: ['南翔', '江桥', '新城'],
  金山区: ['朱泾', '金山新城'],
  松江区: ['松江新城', '泗泾', '九亭'],
  青浦区: ['徐泾', '青浦新城', '赵巷'],
  奉贤区: ['南桥', '奉贤新城'],
  崇明区: ['城桥'],
};

export const LOCATION_REGIONS = Object.keys(LOCATION_DATA);
export const LOCATION_DISTRICTS = Array.from(
  new Set(Object.values(LOCATION_DATA).flat()),
);
